BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega64HVE2.PIC
        <edc:AdjustPoint edc:_addr="0x70" edc:offset="0xE"/>
        <edc:SFRDef edc:_addr="0x7E" edc:access="------nn" edc:cname="DIDR0" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PA0DID" edc:desc="When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled." edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PA1DID" edc:desc="When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled." edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x7F" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x80" edc:access="nnnnn--n" edc:cname="TCCR1A" edc:nzwidth="0x8" ltx:memberofperipheral="TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WGM10" edc:desc="Waveform Generation Mode" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="ICS1" edc:desc="Input Capture Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICES1" edc:desc="Input Capture Edge Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICNC1" edc:desc="Input Capture Noise Canceler" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICEN1" edc:desc="Input Capture Mode Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TCW1" edc:desc="Timer/Counter Width" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x81" edc:access="-----nnn" edc:cname="TCCR1B" edc:nzwidth="0x8" ltx:memberofperipheral="TC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:desc="Clock Select1 bis" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="No Clock Source (Stopped)" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Running, No Prescaling" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Running, CLK/8" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Running, CLK/64" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="Running, CLK/256" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="Running, CLK/1024" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="Running, ExtClk Tx Falling Edge" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="Running, ExtClk Tx Rising Edge" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x82" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0x84" edc:access="nnnnnnnnnnnnnnnn" edc:cname="TCNT1" edc:nzwidth="0x10" ltx:memberofperipheral="TC1"/>
        <edc:AdjustPoint edc:_addr="0x86" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0x88" edc:access="nnnnnnnn" edc:cname="OCR1A" edc:nzwidth="0x8" ltx:memberofperipheral="TC1"/>
        <edc:SFRDef edc:_addr="0x89" edc:access="nnnnnnnn" edc:cname="OCR1B" edc:nzwidth="0x8" ltx:memberofperipheral="TC1"/>
        <edc:AdjustPoint edc:_addr="0x8A" edc:offset="0x36"/>
        <edc:SFRDef edc:_addr="0xC0" edc:access="nnnnnnnn" edc:cname="LINCR" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCMD" edc:desc="LIN Command and Mode bits" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="LENA" edc:desc="LIN or UART Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LCONF" edc:desc="LIN Configuration bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="LIN13" edc:desc="LIN Standard" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LSWRES" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xC1" edc:access="nnnnnnnn" edc:cname="LINSIR" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LRXOK" edc:desc="Receive Performed Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LTXOK" edc:desc="Transmit Performed Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LIDOK" edc:desc="Identifier Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LERR" edc:desc="Error Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LBUSY" edc:desc="Busy Signal" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LIDST" edc:desc="Identifier Status bits" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xC2" edc:access="----nnnn" edc:cname="LINENIR" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LENRXOK" edc:desc="Enable Receive Performed Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LENTXOK" edc:desc="Enable Transmit Performed Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LENIDOK" edc:desc="Enable Identifier Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LENERR" edc:desc="Enable Error Interrupt" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xC3" edc:access="nnnnnnnn" edc:cname="LINERR" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LBERR" edc:desc="Bit Error Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LCERR" edc:desc="Checksum Error Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LPERR" edc:desc="Parity Error Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LSERR" edc:desc="Synchronization Error Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LFERR" edc:desc="Framing Error Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LOVERR" edc:desc="Overrun Error Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LTOERR" edc:desc="Frame Time Out Error Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LABORT" edc:desc="Abort Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xC4" edc:access="n-nnnnnn" edc:cname="LINBTR" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LBT" edc:desc="LIN Bit Timing bits" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="LDISR" edc:desc="Disable Bit Timing Resynchronization" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
