BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega64HVE2.PIC
        <edc:SFRDef edc:_addr="0xC5" edc:access="nnnnnnnn" edc:cname="LINBRRL" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LDIV" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xC6" edc:access="----nnnn" edc:cname="LINBRRH" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LDIV" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xC7" edc:access="nnnnnnnn" edc:cname="LINDLR" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LRXDL" edc:desc="LIN Receive Data Length bits" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="LTXDL" edc:desc="LIN Transmit Data Length bits" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xC8" edc:access="nnnnnnnn" edc:cname="LINIDR" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LID" edc:desc="Identifier bit 5 or Data Length bits" edc:nzwidth="0x6"/>
              <edc:SFRFieldDef edc:cname="LP" edc:desc="Parity bits" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xC9" edc:access="----nnnn" edc:cname="LINSEL" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LINDX" edc:desc="FIFO LIN Data Buffer Index bits" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="LAINC" edc:desc="Auto Increment of Data Buffer Index (Active Low)" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xCA" edc:access="nnnnnnnn" edc:cname="LINDAT" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LDATA" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xCB" edc:offset="0x6"/>
        <edc:SFRDef edc:_addr="0xD1" edc:access="-----nnn" edc:cname="BGCSRA" edc:nzwidth="0x8" ltx:memberofperipheral="BANDGAP">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BGSC" edc:desc="Band Gap Sample Configuration" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD2" edc:access="nnnnnnnn" edc:cname="BGCRB" edc:nzwidth="0x8" ltx:memberofperipheral="BANDGAP">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BGCL" edc:desc="Band Gap Calibration Linear" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD3" edc:access="nnnnnnnn" edc:cname="BGCRA" edc:nzwidth="0x8" ltx:memberofperipheral="BANDGAP">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BGCN" edc:desc="Band Gap Calibration Nominal" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD4" edc:access="------nn" edc:cname="BGLR" edc:nzwidth="0x8" ltx:memberofperipheral="BANDGAP">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BGPL" edc:desc="Band Gap Lock" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BGPLE" edc:desc="Band Gap Lock Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xD5" edc:offset="0x3"/>
        <edc:SFRDef edc:_addr="0xD8" edc:access="--nn--nn" edc:cname="PLLCSR" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PLLCIE" edc:desc="PLL Lock Change Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PLLCIF" edc:desc="PLL Lock Change Interrupt Flag" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="LOCK" edc:desc="PLL Lock" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWEN" edc:desc="PLL Software Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xD9" edc:offset="0x3"/>
        <edc:SFRDef edc:_addr="0xDC" edc:access="n---n--n" edc:cname="PBOV" edc:nzwidth="0x8" ltx:memberofperipheral="PORTB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PBOE0" edc:desc="Port B Override Enable 0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PBOE3" edc:desc="Port B Override Enable 3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="PBOVCE" edc:desc="Port B Override Change Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xDD" edc:offset="0x3"/>
        <edc:SFRDef edc:_addr="0xE0" edc:access="-----nnn" edc:cname="ADSCSRA" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCMD" edc:desc="Synchronization Command" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Reset and Synchronize" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Synchronize on next Instantaneous Conversion" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Synchronize on next Accumulated Conversion" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="SBSY" edc:desc="Synchronization Busy" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE1" edc:access="-nnn-nnn" edc:cname="ADSCSRB" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CADICRB" edc:desc="CADIC Data Read Out Busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CADACRB" edc:desc="CADAC Data Read Out Busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CADICPS" edc:desc="C-ADC Instantaneous Conversion Polarity Status" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="VADICRB" edc:desc="VADIC Data Read Out Busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VADACRB" edc:desc="VADAC Data Read Out Busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VADICPS" edc:desc="V-ADC Instantaneous Conversion Polarity Status" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE2" edc:access="----nnnn" edc:cname="ADCRA" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CKSEL" edc:desc="Sampling Clock Select" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="PLL (512kHz output) as sampling clock" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Slow RC Oscillator as sampling clock" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="ADCMS" edc:desc="C-ADC Chopper Mode Select" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Chopping Disabled" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Automatic Fast Chopping" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Automatic Slow Chopping" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Software Polarity Control" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="ADPSEL" edc:desc="ADC Polarity Select" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE3" edc:access="---nnnnn" edc:cname="ADCRB" edc:nzwidth="0x8" ltx:memberofperipheral="ADC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADADES" edc:desc="Accumulated Decimation Ratio Select" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="512" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="256" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="128" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="64" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="32" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="16" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="8" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="4" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="ADIDES" edc:desc="Instantaneous Decimation Ratio Select" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="512" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="256" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="128" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="64" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
